{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "cane",
    "1": "cavallo",
    "2": "elefante",
    "3": "farfalla",
    "4": "gallina",
    "5": "gatto",
    "6": "mucca",
    "7": "pecora",
    "8": "ragno",
    "9": "scoiattolo"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "cane": "0",
    "cavallo": "1",
    "elefante": "2",
    "farfalla": "3",
    "gallina": "4",
    "gatto": "5",
    "mucca": "6",
    "pecora": "7",
    "ragno": "8",
    "scoiattolo": "9"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.22.0.dev0"
}
